{
  "config": {
    "step": {
      "user": {
        "title": "Configurează SMS.to",
        "description": "Introdu cheia API și ID-ul expeditorului pentru a configura notificările SMS.to.",
        "data": {
          "api_key": "Cheie API",
          "sender_id": "ID Expeditor"
        }
      },
      "test_message": {
        "title": "Mesaj de Test",
        "description": "Introdu un număr de telefon pentru a trimite un mesaj de test și pentru a verifica funcționalitatea integrării.",
        "data": {
          "test_number": "Număr Telefon Test"
        }
      }
    },
    "error": {
      "invalid_api_key": "Cheia API furnizată este invalidă. Te rugăm să introduci o cheie API validă.",
      "invalid_sender_id": "ID-ul Expeditorului furnizat este invalid. Te rugăm să introduci un ID Expeditor valid.",
      "server_unavailable": "Serverul SMS.to este indisponibil momentan. Te rugăm să încerci din nou mai târziu.",
      "api_key_expired": "Cheia API a expirat. Te rugăm să actualizezi cheia API.",
      "invalid_test_number": "Numărul de telefon pentru test este invalid. Te rugăm să introduci un număr valid.",
      "test_message_failed": "Trimiterea mesajului de test a eșuat. Te rugăm să verifici configurația și să încerci din nou."
    },
    "abort": {
      "already_configured": "Acest cont este deja configurat. Actualizează integrarea existentă dacă este necesar."
    }
  },
  "services": {
    "notify_smsto": {
      "name": "Notificare SMS.to",
      "description": "Trimite o notificare SMS prin SMS.to.",
      "fields": {
        "message": {
          "name": "Mesaj",
          "description": "Textul notificării care trebuie trimis. Acest câmp este obligatoriu.",
          "example": "Comanda ta a fost expediată!"
        },
        "title": {
          "name": "Titlu",
          "description": "Titlul notificării (opțional). Acesta va apărea deasupra textului mesajului.",
          "example": "Actualizare Comandă"
        },
        "target": {
          "name": "Destinatar",
          "description": "O listă de numere de telefon către care se trimite notificarea. Fiecare număr trebuie să fie în format internațional.",
          "example": "+40730040302, +40740040303"
        },
        "data": {
          "name": "Date Suplimentare",
          "description": "Date suplimentare specifice platformei, precum un URL de callback sau nivelul de prioritate.",
          "example": "callback_url=https://example.com/callback"
        }
      }
    }
  },
  "options": {
    "step": {
      "init": {
        "title": "Modifică Setările SMS.to",
        "description": "Actualizează cheia API sau ID-ul Expeditor pentru notificările SMS.to.",
        "data": {
          "api_key": "Cheie API",
          "sender_id": "ID Expeditor"
        }
      }
    },
    "error": {
      "invalid_api_key": "Cheia API actualizată este invalidă. Te rugăm să verifici și să încerci din nou.",
      "invalid_sender_id": "ID-ul Expeditor actualizat este invalid. Te rugăm să verifici și să încerci din nou."
    }
  }
}
